let array = [
  // 1.考察map方法
  'let arr = [44, 0, -2, 33, 7]，创建一个新数组arrNew，里面的值为arr各项的2倍，并打印其值？',
  // 2.考察push方法
  'let arr = [1, 2, 3]，将a, b, c逐个添加到arr数组末尾，并打印其值？',
  // 3.考察unshift方法
  'let arr = [1, 2, 3]，将a, b, c逐个添加到arr数组开头，并打印其值？',
  // 4.考察shift方法
  'let arr = [0, 1, 2, 3, 4, 5]，删除arr中值为0, 1, 2的三项，并打印其值？',
  // 5.考察pop方法
  'let arr = [0, 1, 2, 3, 4, 5]，删除arr中值为为3, 4, 5的三项，并打印其值？',
  
  // 6.考察concat方法
  'let arr = [1, 2, 3]，let arr2 = [3, 4, 5]，合并数组arr和arr2，并打印其值？',
  // 7.考察reverse方法
  'let arr = [1, 2, 3, 4, 5, 6]，创建一个新数组arrNew，里面的值为[6, 5, 4, 3, 2, 1]， 并打印其值？',

  // 8.考察sort方法
  'let arr = [66,1,0,3,-1,8,88,166]，降序排列arr的各项值，并打印其值？',

  // 9.考察join方法
  'let arr = [66,1,0,3,-1,8,88,166]，1.创建一个字符串str，值为"66,1,0,3,-1,8,88,66"，2.创建一个字符串str，值为"66&1&0&3&-1&8&88&66"，并打印其值？',
  // 10.考察splice方法,删除
  'let arr = [1, 2, 3, 4, 5]，删除值为3，4的项，并打印其值？',
  // 11.考察splice方法,插入
  'let arr = [1, 2, 3, 4, 5]，在3和4中间插入a, b, c三项，并打印其值？',
  // 12.考察splice方法,替换
  'let arr = [1, 2, 3, 4, 5]，将4和5替换成a, b, c三项，并打印其值？',

  // 13.考察slice方法
  'let arr = [1, 2, 3, 4, 5, 7]，使用数组slice方法,将值为3和4的项从arr中截取出来，并打印截取的值和arr？',
  
  // 14.考察some方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，判断arr中是否有大于18的值，如果有var a = true，否则false，并打印a',

  // 15.考察every方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，判断arr中的值，是否全部小于200，如果有var a = true，否则false，并打印a',

  // 16.考察filter方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，在arr中找出大于18的值，并将值装进var arrNew中;，并打印',

  // 17.考察find方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，在arr中找出大于18的第一个值，并赋值给var a;，a并打印',

  // 18.考察findIndex方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，在arr中找出大于18的第一个值的下标，并赋值给var aIndex;，并打印aIndex',

  // 19.考察isArray方法
  'let arr = [1, 2, 3, -1 ,-2,-18, 18, 200, 45, 7]，判断arr是否是数组，并赋值给var isArr;，并打印isArr',
];